mathews0x0/datalogger-v2/firmware_p4/firmware/sdkconfig.defaults
# ============================================================
# RaceSense ESP32-P4 Default SDK Configuration
# Target: Waveshare ESP32-P4-WIFI6-Touch-LCD-4.3
# ============================================================

# --- Chip Target ---
CONFIG_IDF_TARGET="esp32p4"

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM (32MB PSRAM on Waveshare board) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- Wi-Fi & Networking ---
# ESP-Hosted is deferred during display bring-up: its SDIO task currently
# conflicts with the SDMMC host and resets the board.
# CONFIG_ESP_HOSTED_ENABLED is not set
# CONFIG_ESP_WIFI_REMOTE_ENABLED is not set
# The ESP32-C6 hosted Wi-Fi stack's EAP bridge does not compile against
# ESP-IDF 5.3.  RaceSense uses WPA/WPA2 personal hotspots only.
# CONFIG_ESP_WIFI_REMOTE_EAP_ENABLED is not set

# Waveshare's ESP32-P4 is revision v1.3.  ESP-IDF 5.5 defaults to the
# mutually-incompatible v3.1+ silicon family, so retain compatibility with
# the original v1.x P4 hardware.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=y
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# The connected Waveshare board uses a 32 MB GigaDevice flash part.
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

# --- FAT Filesystem (SDIO SD Card) ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# --- SDMMC Host (4-bit SDIO 3.0) ---
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y

# --- LWIP (Networking stack for esp-hosted) ---
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_SO_RCVBUF=y

# --- HTTPS / MbedTLS ---
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# --- NTP ---
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_EN=y

# --- Power Management ---
CONFIG_PM_ENABLE=y

# --- LVGL Display ---
CONFIG_RS_DISPLAY_PROFILE_800_480=y
# MIPI-DSI consumes RGB565 words directly.  Byte swapping is only needed for
# the old 8-bit SPI display transport and corrupts P4 colours.
# CONFIG_LV_COLOR_16_SWAP is not set
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
